[gold]
# Read original AES design
read_verilog -sv -DGOLD aes_128.v
read_verilog -sv -DGOLD round.v 
read_verilog -sv -DGOLD table.v
read_verilog -sv -DGOLD top.v
read_verilog -sv -DGOLD TSC.v

[gate]
# Read Trojan-inserted design
read_verilog -sv -DGATE f_aes_500.v

[script]
prep -top top
memory_map

[strategy sat]
use sat
depth 100

[strategy induction]
use sby
engine abc pdr